package com.learn.world.spring.购房通;

import java.io.UnsupportedEncodingException;

/**
 * @author wencheng
 * @create 2022/2/20 10:41
 */
public class RTes {
    public static void main(String[] args) throws UnsupportedEncodingException {
//        System.out.println((char)01000010);
        String str = "æµ\u0094é\u0098³æ±\u009Få¤´å¤\u009Cé\u0080\u0081å®¢ï¼\u008Cæ\u009E«å\u008F¶è\u008D\n" +
                "»è\u008A±ç§\u008Bç\u0091\u009Fç\u0091\u009Fã\u0080\u0082\n" +
                "ä¸»äººä¸\u008Bé©¬å®¢\n" +
                "å\u009C¨è\u0088¹ï¼\u008Cä¸¾é\u0085\u0092æ¬²é¥®æ\u0097 ç®¡å¼¦ã\u0080\n" +
                "\u0082\n" +
                "é\u0086\u0089ä¸\u008Dæ\u0088\u0090æ¬¢æ\u0083¨å°\u0086å\u0088«ï¼\u008Cå\u0088«æ\u0097¶\n" +
                "è\u008C«è\u008C«æ±\u009Fæµ¸æ\u009C\u0088ã\u0080\u0082\n" +
                "å¿½é\u0097»æ°´ä¸\u008Aç\n" +
                "\u0090µç\u0090¶å£°ï¼\u008Cä¸»äººå¿\u0098å½\u0092å®¢ä¸\u008Då\u008F\u0091\n" +
                "ã\u0080\u0082\n" +
                "å¯»å£°æ\u009A\u0097é\u0097®å¼¹è\u0080\u0085è°\u0081ï¼\u008Cç\u0090µç\n" +
                "\u0090¶å£°å\u0081\u009Cæ¬²è¯\u00ADè¿\u009Fã\u0080\u0082\n" +
                "ç§»è\u0088¹ç\u009B¸è¿\n" +
                "\u0091é\u0082\u0080ç\u009B¸è§\u0081ï¼\u008Cæ·»é\u0085\u0092å\u009B\u009Eç\u0081¯é\u0087\u008Då¼\u0080å\n" +
                "®´ã\u0080\u0082\n" +
                "å\u008D\u0083å\u0091¼ä¸\u0087å\u0094¤å§\u008Bå\u0087ºæ\u009D¥ï¼\u008Cç\u008A\n" +
                "¹æ\u008A±ç\u0090µç\u0090¶å\u008D\u008Aé\u0081®é\u009D¢ã\u0080\u0082\n" +
                "è½¬è½´æ\u008B¨\n" +
                "å¼¦ä¸\u0089ä¸¤å£°ï¼\u008Cæ\u009Cªæ\u0088\u0090æ\u009B²è°\u0083å\u0085\u0088æ\u009C\n" +
                "\u0089æ\u0083\u0085ã\u0080\u0082\n" +
                "å¼¦å¼¦æ\u008E©æ\u008A\u0091å£°å£°æ\u0080\u009Dï¼\u008C\n" +
                "ä¼¼è¯\u0089å¹³ç\u0094\u009Fä¸\u008Då¾\u0097å¿\u0097ã\u0080\u0082\n" +
                "ä½\u008Eç\u009C\u0089ä\n" +
                "¿¡æ\u0089\u008Bç»\u00ADç»\u00ADå¼¹ï¼\u008Cè¯´å°½å¿\u0083ä¸\u00ADæ\u0097 \n" +
                "é\u0099\u0090äº\u008Bã\u0080\u0082\n" +
                "è½»æ\u008B¢æ\u0085¢æ\u008D»æ\u008A¹å¤\u008Dæ\u008C\u0091ï\n" +
                "¼\u008Cå\u0088\u009Dä¸ºé\u009C\u0093è£³å\u0090\u008Eå\u0085\u00ADå¹ºã\u0080\u0082\n" +
                "å¤§å¼\n" +
                "¦å\u0098\u0088å\u0098\u0088å¦\u0082æ\u0080¥é\u009B¨ï¼\u008Cå°\u008Få¼¦å\u0088\u0087å\u0088\u0087å\n" +
                "¦\u0082ç§\u0081è¯\u00ADã\u0080\u0082\n" +
                "å\u0098\u0088å\u0098\u0088å\u0088\u0087å\u0088\u0087é\u0094\u0099æ\u009D\u0082å¼\n" +
                "¹ï¼\u008Cå¤§ç\u008F å°\u008Fç\u008F è\u0090½ç\u008E\u0089ç\u009B\u0098ã\u0080\u0082\n" +
                "é\u0097´\n" +
                "å\u0085³è\u008Eºè¯\u00ADè\u008A±åº\u0095æ»\u0091ï¼\u008Cå¹½å\u0092½æ³\u0089æµ\n" +
                "\u0081å\u0086°ä¸\u008Bé\u009A¾ã\u0080\u0082\n" +
                "å\u0086°æ³\u0089å\u0086·æ¶©å¼¦å\u0087\u009D\n" +
                "ç»\u009Dï¼\u008Cå\u0087\u009Dç»\u009Dä¸\u008Dé\u0080\u009Aå£°æ\u009A\u0082æ\u00AD\u0087ã\u0080\u0082\n" +
                "å\n" +
                "\u0088«æ\u009C\u0089å¹½æ\u0084\u0081æ\u009A\u0097æ\u0081¨ç\u0094\u009Fï¼\u008Cæ\u00AD¤æ\u0097¶æ\u0097 \n" +
                "å£°è\u0083\u009Cæ\u009C\u0089å£°ã\u0080\u0082\n" +
                "é\u0093¶ç\u0093¶ä¹\u008Dç ´æ°´æ\n" +
                "µ\u0086è¿¸ï¼\u008Cé\u0093\u0081éª\u0091çª\u0081å\u0087ºå\u0088\u0080æ\u009Eªé¸£ã\u0080\u0082\n" +
                "\n" +
                "æ\u009B²ç»\u0088æ\u0094¶æ\u008B¨å½\u0093å¿\u0083ç\u0094»ï¼\u008Cå\u009B\u009Bå¼¦ä\n" +
                "¸\u0080å£°å¦\u0082è£\u0082å¸\u009Bã\u0080\u0082\n" +
                "ä¸\u009Cè\u0088¹è¥¿è\u0088«æ\u0082\n" +
                "\u0084æ\u0097 è¨\u0080ï¼\u008Cå\u0094¯è§\u0081æ±\u009Få¿\u0083ç§\u008Bæ\u009C\u0088ç\u0099½ã\n" +
                "\u0080\u0082\n" +
                "æ²\u0089å\u0090\u009Fæ\u0094¾æ\u008B¨æ\u008F\u0092å¼¦ä¸\u00ADï¼\u008Cæ\u0095´é¡\n" +
                "¿è¡£è£³èµ·æ\u0095\u009Bå®¹ã\u0080\u0082";
        System.out.println(toUTF(str));

        String msg = str;
        System.out.println("---------------------编码后字节数----------------------------");
        //编码，字节数组
        byte[] datas=msg.getBytes(); //使用默认工程的字符集 默认为UTF-8
        System.out.println(datas.length);


        System.out.println("---------------------解码后字符----------------------------");
        System.out.println();
        //正确解码
        //String(byte[] bytes,int offset, int length,String charsetName);
        //byte[] bytes 字节数组；
        //offset 开始解析的位置
        //length 字节长度
        //charsetName 字符集
        msg=new String(datas,0,datas.length,"utf8");
        System.out.println(msg);

    }

    public static String toUTF(String inStr) throws UnsupportedEncodingException

    {

        String outStr = "";

        if(inStr != null)

        {

            inStr=java.net.URLDecoder.decode(inStr);//不用decode了,到这的时候就已经自动decode过了

            //将字符串转为UTF-8编码形式

            outStr = new String(inStr.getBytes("iso-8859-1"),"UTF-8");

        }

        return outStr;

    }
}
